.planning/case_profiles/case_025_v64_poiseuille_dicts/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Incompressible Newtonian (air-like) · ν = 1.5e-5 m²/s · per briefing target
// → Re_h = u_mean·(2H)/ν = 0.1·0.02/1.5e-5 = 133.33 (deep laminar · no model)
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

nu              1.5e-05;

// ************************************************************************* //
